ms-vscode.cpptools
golang.go
rust-lang.rust-analyzer
ms-dotnettools.csharp
redhat.java
esbenp.prettier-vscode
dbaeumer.vscode-eslint
ms-python.python
ms-python.black-formatter
ms-python.isort
jnoortheen.nix-ide
eamodio.gitlens
ms-vscode.makefile-tools
